GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_spi.c
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32H77x)
        /* Cache-aligned DMA buffers (used when original buffers are not 32-byte aligned) */
        void *dma_tx_buf = RT_NULL;
        void *dma_rx_buf = RT_NULL;

        /* H7xx requires setting the data frame number before DMA transfer */
        spi_current_data_num_config(spi_periph, size);

        /* DCache coherency: ensure DMA buffers are 32-byte cache-line aligned.
         * Only needed for MCUs with DCache (H7xx series). */
        if (send_ptr != RT_NULL)
        {
            if (RT_IS_ALIGN((rt_uint32_t)send_ptr, 32) && RT_IS_ALIGN(size, 32))
            {
                dma_send_ptr = send_ptr;
            }
            else
            {
                dma_tx_buf = rt_malloc_align(RT_ALIGN(size, 32), 32);
                if (dma_tx_buf == RT_NULL)
                {
                    LOG_E("%s DMA tx alloc failed", spi_device->bus_name);
                    ret = -RT_ENOMEM;
                    goto _exit;
                }
                rt_memset(dma_tx_buf, 0, RT_ALIGN(size, 32));
                rt_memcpy(dma_tx_buf, send_ptr, size);
                dma_send_ptr = (const rt_uint8_t *)dma_tx_buf;
            }
            rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, (void *)dma_send_ptr, RT_ALIGN(size, 32));
        }
        
        if (recv_ptr != RT_NULL)
        {
            if (RT_IS_ALIGN((rt_uint32_t)recv_ptr, 32) && RT_IS_ALIGN(size, 32))
            {
                dma_recv_ptr = recv_ptr;
            }
            else
            {
                dma_rx_buf = rt_malloc_align(RT_ALIGN(size, 32), 32);
                if (dma_rx_buf == RT_NULL)
                {
                    LOG_E("%s DMA rx alloc failed", spi_device->bus_name);
                    if (dma_tx_buf != RT_NULL) rt_free_align(dma_tx_buf);
                    ret = -RT_ENOMEM;
                    goto _exit;
                }
                rt_memset(dma_rx_buf, 0, RT_ALIGN(size, 32));
                dma_recv_ptr = (rt_uint8_t *)dma_rx_buf;
            }
        }
#endif /* H7xx DCache */
        
        /* Configure RX DMA */
        if (spi_device->dma_rx != RT_NULL)
        {
            dma_channel_disable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
            
            if (recv_ptr != RT_NULL)
            {
                dma_memory_address_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, 
                                         DMA_MEMORY_0, (uint32_t)dma_recv_ptr);
                dma_memory_address_generation_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_MEMORY_INCREASE_ENABLE);
            }
            else
            {
                dma_memory_address_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, 
                                         DMA_MEMORY_0, (uint32_t)&dummy_rx);
                dma_memory_address_generation_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_MEMORY_INCREASE_DISABLE);
            }
            
            dma_transfer_number_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, size);
            dma_interrupt_enable(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_CHXCTL_FTFIE);
            dma_channel_enable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
            spi_dma_enable(spi_periph, SPI_DMA_RECEIVE);
        }
        
        /* Configure TX DMA */
        if (spi_device->dma_tx != RT_NULL)
        {
            dma_channel_disable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
            
            if (send_ptr != RT_NULL)
            {
                dma_memory_address_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, 
                                         DMA_MEMORY_0, (uint32_t)dma_send_ptr);
                dma_memory_address_generation_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_MEMORY_INCREASE_ENABLE);
            }
            else
            {
                dma_memory_address_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, 
                                         DMA_MEMORY_0, (uint32_t)&dummy_tx);
                dma_memory_address_generation_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_MEMORY_INCREASE_DISABLE);
            }
            
            dma_transfer_number_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, size);
            dma_interrupt_enable(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_CHXCTL_FTFIE);
            dma_channel_enable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
            spi_dma_enable(spi_periph, SPI_DMA_TRANSMIT);
        }

#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32H77x)
        /* H7xx requires explicit master transfer start */
        spi_master_transfer_start(spi_periph, SPI_TRANS_START);
#endif
        
        /* Wait for transfer complete with timeout */
        rt_tick_t timeout = rt_tick_from_millisecond(BSP_SPI_XFER_TIMEOUT);
        rt_tick_t start = rt_tick_get();
        
        while (1)
        {
            rt_bool_t tx_done = RT_TRUE;
            rt_bool_t rx_done = RT_TRUE;
            
            if (spi_device->dma_tx != RT_NULL)
            {
                tx_done = (dma_flag_get(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_FLAG_FTF) == SET);
            }
            
            if (spi_device->dma_rx != RT_NULL)
            {
                rx_done = (dma_flag_get(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_FLAG_FTF) == SET);
            }
            
            if (tx_done && rx_done)
            {
                break;
            }
            
            if (rt_tick_get() - start > timeout)
            {
				LOG_E("%s DMA transfer timeout", spi_device->bus_name);
                gd32_spi_dma_cleanup(spi_device, spi_periph);
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32H77x)
                if (dma_tx_buf != RT_NULL) rt_free_align(dma_tx_buf);
                if (dma_rx_buf != RT_NULL) rt_free_align(dma_rx_buf);
#endif
                ret = -RT_EIO;
                goto _exit;
            }
            
