GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_spi.c
            rt_thread_mdelay(1);
        }

        /* Disable DMA and clear flags */
        gd32_spi_dma_cleanup(spi_device, spi_periph);

#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32H77x)
        /* DCache coherency: invalidate RX buffer and copy back if re-aligned.
         * Must invalidate full cache lines (32 bytes) to avoid corrupting
         * adjacent heap metadata when size is not cache-line aligned. */
        if (recv_ptr != RT_NULL)
        {
            rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, (void *)dma_recv_ptr, RT_ALIGN(size, 32));
            if (dma_rx_buf != RT_NULL)
            {
                rt_memcpy(recv_ptr, dma_recv_ptr, size);
            }
        }
        
        /* Free aligned temporary buffers */
        if (dma_tx_buf != RT_NULL)
        {
            rt_free_align(dma_tx_buf);
        }
        if (dma_rx_buf != RT_NULL)
        {
            rt_free_align(dma_rx_buf);
        }
#endif /* H7xx DCache */
        
        LOG_D("spi DMA transfer finish");
    }
    else
#endif /* BSP_USING_SPI_DMA */
    {
        if(config->data_width <= 8)
        {
            const rt_uint8_t * send_ptr = message->send_buf;
            rt_uint8_t * recv_ptr = message->recv_buf;
            rt_uint32_t size = message->length;

            LOG_D("spi poll transfer start: %d\n", size);

            while(size--)
            {
                rt_uint8_t data = 0xFF;

                if(send_ptr != RT_NULL)
                {
                    data = *send_ptr++;
                }

                /* Todo: replace register read/write by gd32f4 lib */
                /* Wait until the transmit buffer is empty */
                #if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
                spi_master_transfer_start(spi_periph, SPI_TRANS_START);
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_TP) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                #else
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_TBE) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                #endif
                /* Send the byte */
                spi_i2s_data_transmit(spi_periph, data);

                /* Wait until a data is received */
                #if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_RP) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                #else
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_RBNE) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                #endif
                /* Get the received data */
                data = spi_i2s_data_receive(spi_periph);

                if(recv_ptr != RT_NULL)
                {
                    *recv_ptr++ = data;
                }
            }
            LOG_D("spi poll transfer finsh\n");
        }
        else if(config->data_width <= 16)
        {
            const rt_uint16_t * send_ptr = message->send_buf;
            rt_uint16_t * recv_ptr = message->recv_buf;
            rt_uint32_t size = message->length;

            while(size--)
            {
                rt_uint16_t data = 0xFF;

                if(send_ptr != RT_NULL)
                {
                    data = *send_ptr++;
                }

                /* Wait until the transmit buffer is empty */
                #if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
                spi_master_transfer_start(spi_periph, SPI_TRANS_START);
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_TP) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                #else
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_TBE) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                #endif
                /* Send the byte */
                spi_i2s_data_transmit(spi_periph, data);

                /* Wait until a data is received */
                #if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_RP) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                #else
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_RBNE) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                #endif
                /* Get the received data */
                data = spi_i2s_data_receive(spi_periph);

                if(recv_ptr != RT_NULL)
                {
                    *recv_ptr++ = data;
                }
            }
        }
        #if defined SOC_SERIES_GD32H7xx || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
        else if(config->data_width <= 32)
        {
            const rt_uint32_t * send_ptr = message->send_buf;
            rt_uint32_t * recv_ptr = message->recv_buf;
            rt_uint32_t size = message->length;
            /* SPI master start transfer */
            spi_master_transfer_start(spi_periph, SPI_TRANS_START);
            while(size--)
            {
                rt_uint32_t data = 0xFF;

                if(send_ptr != RT_NULL)
                {
                    data = *send_ptr++;
                }

                /* Wait until the transmit buffer is empty */
                if (gd32_spi_wait_flag(spi_periph, SPI_FLAG_TP) != RT_EOK)
                {
                    ret = -RT_ETIMEOUT;
                    goto _exit;
                }
                /* Send the byte */
                spi_i2s_data_transmit(spi_periph, data);

